Table of Contents
 Class LoadBase
Namespace
IdeaRS.OpenModel.Detail.Loading
Assembly
IdeaRS.OpenModel.dll
Load base object
public abstract class LoadBase : OpenObject
Inheritance
object
OpenObject
LoadBase
Derived
LineLoad
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Id
Element Id
[DataMember]
public int Id { get; set; }
Property Value
int
 Edit this page